gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_DL698.cpp

#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/RM_RxDATA.h"
#include "../DL698/DL698_Uart.h"
#include "../Device/MEMRW.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Calculate/Calculate.h"
#include "../DL698/EVENT_Record.h"
#include "../Device/IC_TESAM.h"
#include "../DL698/RM_Record.h"

#include "../MS/MS.h"
//void my_printf(char *pStr,u32 param1,u32 param2,u32 param3)
//{
//	ms_Type *ms;
//	ms=Get_ms();
//	ms->link_printf((char *)pStr,param1,param2,param3);
//}

 #include "../DL698/DL698_JSON.h"
u32 RM_RxDATA_DL698_CHECK(u32 PORTn)//DL698帧接收数据检查,比较发收地址、控制码、数据标识、减0x33;返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
{
	u32 i;
	u32 x;
	u32 n;
	u8* p8rx;
	UARTCtrl_TypeDef * UARTCtrl;
#if RM_SECURITY_CompMAC==1//0=否,1=是,安全模式抄表时进行MAC校验码比较
	u8* p8;
	u32 DL698ByteTypeLenByte;
#endif
	u64 d64a;
	u64 d64b;
	u32 y;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	if((p8rx[4]&0x0f)!=5)
	{
		return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
	}
/*
#if ((Project/100)==2)//集中器
#if SEL_RouterRunMode3ADDR==1//微功率无线发送帧目标地址:0=电能表地址，1=采集器地址
	if((PORTn==RS485_4PORT)&&(Terminal_Router->RouterRunMode_1==3))//路由运行模式_通信方式：1表示"窄带电力线载波通信"，2表示"宽带电力线载波通信"，3表示"微功率无线通信"，其它取值保留
	{//微功率无线,目标地址用采集器地址
		i=UARTCtrl->TaskID;
		i>>=8;
		i&=0xff;
		switch(i)
		{
			case RMTASKnoPOWER://停上电事件固定任务号
				i=UARTCtrl->MeterCount[i];
				i=PowerEvent->setno[i];
				break;
			default:
				i=UARTCtrl->MeterCount[i];
				break;
		}
		p8=(u8*)ADDR_6000_SDRAM+(i*LENper_6000);
		p8=Get_Element(p8,3,0,0);//计算元素地址
		if(p8)
		{//采集器可取
			p8+=5;
			x=p8[4]|(p8[5]<<8);
			i=(p8rx[5]<<8)|p8rx[6];
			if(i!=x)
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			x=p8[2]|(p8[3]<<8);
			i=(p8rx[7]<<8)|p8rx[8];
			if(i!=x)
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			x=p8[0]|(p8[1]<<8);
			i=(p8rx[9]<<8)|p8rx[10];
			if(i!=x)
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
		}
		else
		{
			return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
		}
	}
	else
#endif
#endif
*/
	#if (USER/100)==17//江苏系
	i=UARTCtrl->TaskID;
	i>>=8;
	i&=0xff;
	if(i==0x22)
	{
		if((((UARTCtrl->TaskID>>20)&0xf)==5)&&(Terminal_Router->MinuteCollect==1))
		//if(((UARTCtrl->TaskID>>20)&0xf)==5)
		{
			switch(i)
			{
				case RMTASKnoPOWER://停上电事件固定任务号
					i=UARTCtrl->MeterCount[i];
					i=PowerEvent->setno[i];
					break;
				default:
					i=UARTCtrl->MeterCount[i];
					break;
			}
			d64a=MRR((u32)p8rx+5,6);
			#if 0
			x=Terminal_Router->NoteNum1;//已知总从节点数
			for(y=0;y<x;y++)
			{
				d64b=MRR((u32)&NoteList1->List1[y].CollectorAddr,6);
				if(d64a==d64b)
				{
					break;//原已存在
				}
			}
			if(y==x)
			{
				x=Terminal_Router->NoteNum1;//已知总从节点数
				for(y=0;y<x;y++)
				{
					d64b=MRR((u32)&NoteList1->List1[y].Addr,6);
					if(d64a==d64b)
					{
						break;//原已存在
					}
				}
				if(x==y)
				{
					i=(p8rx[5]<<8)|p8rx[6];
					if(i!=UARTCtrl->RMAddr[2])
					{
						myprintf("[%s:%d]:地址错\n",(u32)&__func__,(u32)__LINE__,0);
						return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
					}
					i=(p8rx[7]<<8)|p8rx[8];
					if(i!=UARTCtrl->RMAddr[1])
					{
						myprintf("[%s:%d]:地址错\n",(u32)&__func__,(u32)__LINE__,0);
						return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
					}
					i=(p8rx[9]<<8)|p8rx[10];
					if(i!=UARTCtrl->RMAddr[0])
					{
						myprintf("[%s:%d]:地址错\n",(u32)&__func__,(u32)__LINE__,0);
						return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
					}
				}	
			}
			#else
			x=Terminal_Router->NoteNum;//已知总从节点数
			for(y=0;y<x;y++)
			{
				d64b=MRR((u32)&NoteList->List[y].CollectorAddr,6);
				if(d64a==d64b)
				{
					break;//原已存在
				}
			}
			if(y==x)
			{
				x=Terminal_Router->NoteNum;//已知总从节点数
				for(y=0;y<x;y++)
				{
					d64b=MRR((u32)&NoteList->List[y].Addr,6);
					if(d64a==d64b)
					{
						break;//原已存在
					}
				}
				if(x==y)
				{
					i=(p8rx[5]<<8)|p8rx[6];
					if(i!=UARTCtrl->RMAddr[2])
					{
						return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
					}
					i=(p8rx[7]<<8)|p8rx[8];
					if(i!=UARTCtrl->RMAddr[1])
					{
						return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
					}
					i=(p8rx[9]<<8)|p8rx[10];
					if(i!=UARTCtrl->RMAddr[0])
					{
						return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
					}
				}	
			}
			#endif
		}
		else
		{
			i=(p8rx[5]<<8)|p8rx[6];
			if(i!=UARTCtrl->RMAddr[2])
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			i=(p8rx[7]<<8)|p8rx[8];
			if(i!=UARTCtrl->RMAddr[1])
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			i=(p8rx[9]<<8)|p8rx[10];
			if(i!=UARTCtrl->RMAddr[0])
			{
				return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
		}
	}
	#else
	{
		i=(p8rx[5]<<8)|p8rx[6];
		if(i!=UARTCtrl->RMAddr[2])
		{
			return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
		}
		i=(p8rx[7]<<8)|p8rx[8];
		if(i!=UARTCtrl->RMAddr[1])
		{
			return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
		}
		i=(p8rx[9]<<8)|p8rx[10];
		if(i!=UARTCtrl->RMAddr[0])
		{
			return 1;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
		}
	}
	#endif
#if (USER/100)==17//江苏系
	if((p8rx[3]&0x0f)!=0x03)
	{
		return 3;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
	}
#else
	//控制码
	if(p8rx[3]!=0xc3)
	{
		return 3;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
	}
#endif
	//长度
	i=p8rx[1]+(p8rx[2]<<8);
	if(i<=(13+8+3))
	{
		return 3;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
	}
	
	//安全模式读取
	if(p8rx[14]==0x90)
	{
		//明文+MAC方式验证抄读数据
//68 72 00 C3 05 01 00 00 00 00 00 00 3B 06 
//90 安全响应   		[144]	SECURITY-Response
//00 明文应用数据单元   [0]  octet-string
//59 长度89
//85 03 05 50 04 02 00 03 00 20
//21 02 00 00 00 10 02 00 00 00 
//20 02 00 01 01 1C 07 E2 09 07 
//00 00 00 01 05 06 00 00 03 E8 
//06 00 00 01 90 06 00 00 01 2C 
//06 00 00 00 C8 06 00 00 00 64 
//01 05 06 00 00 03 E8 06 00 00 
//01 90 06 00 00 01 2C 06 00 00 
//00 C8 06 00 00 00 64 00 00 
//01 数据验证信息  CHOICE   OPTIONAL=1
//00 数据MAC    [0]  MAC
//04 24 80 09 E0
//AA AC 16
		
 #if RM_SECURITY_CompMAC==1//0=否,1=是,安全模式抄表时进行MAC校验码比较
	#if RM_SECURITY_MeterNo==0//0=否,1=是;DL698安全模式抄表时先抄读电表表号 或 ESAM序列号
		#error
	#endif
	//注!!!:电能表需先做密钥更新关联电能表表号后才能比对通过
	if(PORTn!=RS485_4PORT)
	{//注!!!:载波口测698事件主动上报互换性时不能判MAC
		//先用电能表表号比较
		MR(ADDR_UART7Tx+7,((u32)&UARTCtrl->RM_Rx_date_40020200)+2,8);
		//16byte Rand
		MR(ADDR_UART7Tx+7+8,(u32)&UARTCtrl->Rand,16);
		//Data2(明文APDU)
		DL698ByteTypeLenByte=Get_DL698ByteTypeLenByte(p8rx+16);//得到DL698字节类型用来表示长度单元的字节数
		x=Get_DL698ByteTypeLenValue(p8rx+16);//得到DL698字节类型长度单元的值
		if((x+2+6+16+4)>(LEN_UART7Tx-7))
		{
			return 3;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
		}
		MR(ADDR_UART7Tx+7+8+16,(u32)p8rx+16+DL698ByteTypeLenByte,x);
		//4byte MAC
		n=Get_DL698ByteTypeLenByte(p8rx+16+DL698ByteTypeLenByte+x+2);//得到DL698字节类型用来表示长度单元的字节数
		MR(ADDR_UART7Tx+7+8+16+x,(u32)p8rx+16+DL698ByteTypeLenByte+x+2+n,4);
		x+=8+16+4;
		//发送： 800E4887+LC+电表表号+Rand+Data2+MAC
		//返回： 9000+0000
		i=TESAM_CMD_TxRx(0x800E4887,x,ADDR_UART7Tx+7);//发送ESAM命令;返回:0=正确发收且返回9000,1=错误
		if(i)
		{
			//再用8byte 通信地址(台体测试软件用通信地址计算)
			p8=(u8*)ADDR_UART7Tx+7;
			p8[0]=0;
			p8[1]=0;
			MR(ADDR_UART7Tx+7+2,(u32)&UARTCtrl->RMAddr,6);
			i=TESAM_CMD_TxRx(0x800E4887,x,ADDR_UART7Tx+7);//发送ESAM命令;返回:0=正确发收且返回9000,1=错误
			if(i)
			{
				return 2;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
		}
	}
 #endif
		//
		x=p8rx[16];
		if(x<128)
		{
			MR((u32)p8rx+14,(u32)p8rx+17,x);
		}
		else
		{
			x&=0x3f;//表示长度的字节数
			if(x==1)
			{//1byte长度
				x=p8rx[17];
				MR((u32)p8rx+14,(u32)p8rx+18,x);
			}
			else
			{//2byte长度
				x=(p8rx[17]<<8)|p8rx[18];
				if(x>(LEN_UART2Rx-14))
				{
					return 3;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
				}
				MR((u32)p8rx+14,(u32)p8rx+19,x);
			}
		}
		x+=14+2;//(长度域L  2Byte(除起始字符和结束字符之外的帧字节数))
		x--;
		p8rx[1]=x;
		p8rx[2]=x>>8;
		Uart_698_HCSFCS(p8rx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
	}
#if (USER/100)==17//江苏系
	if((((UARTCtrl->TaskID>>20)&0xf)==5)&&(Terminal_Router->MinuteCollect==1))
	//if(((UARTCtrl->TaskID>>20)&0xf)==5)
	{
		return 0;
	}
#endif

