gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_DL698.cpp
	//OAD比较
	i=p8rx[15];
	switch(i)
	{
		default:
			return 3;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
	#if (USER/100)==0//电科院
		//互换性测试,自动上报终端抄读698新增事件的返回帧有BUG(85 01变为85 10)
		case 0x10:
	#endif
		case 0x01://GetRequestNormal
/*
			//注:单相表曲线用实时数据
			i=UARTCtrl->RMCSD[2+0]<<24;
			i|=UARTCtrl->RMCSD[2+1]<<16;
			i|=UARTCtrl->RMCSD[2+2]<<8;
			i|=UARTCtrl->RMCSD[2+3];
			if(i==0x50020200)
			{//分钟冻结
				i=UARTCtrl->TaskID;
				i=(i>>8)&0xff;//任务号
				i=UARTCtrl->MeterCount[i];//取档案号
				p8=(u8*)ADDR_6000_SDRAM+(i*LENper_6000);
				p8=Get_Element(p8,2,8,0);//计算元素地址,使用ADDR_128KDATABUFF
				if(p8)
				{
					i=p8[1];//取接线方式
					if(i==1)//未知（0），单相（1），三相三线（2），三相四线（3）
					{//单相表曲线,抄实时数据
						i=p8rx[17+0]<<24;
						i|=p8rx[17+1]<<16;
						i|=p8rx[17+2]<<8;
						i|=p8rx[17+3]<<0;
						if(i!=UARTCtrl->RM_DI)
						{
							return 3;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
						}
						break;
					}
				}
			}
*/
			for(i=0;i<4;i++)
			{
				if(p8rx[17+i]!=UARTCtrl->RMCSD[2+i])
				{
					break;
				}
			}
			if(i<4)
			{
				return 3;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			if(p8rx[21]!=1)
			{//0=错误，1=记录数据
				return 2;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			break;
	#if (USER/100)==17//江苏系
		case 2://GetRequestNormalList
		case 6://ReportNotificationSimplifyRecord
			return 0;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
	#endif
//		case 2://GetRequestNormalList
//			return 3;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
		case 0x03://GeResponseRecord
			for(i=0;i<4;i++)
			{
				if(p8rx[17+i]!=UARTCtrl->RMCSD[2+i])
				{
					return 3;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
				}
			}
			i=p8rx[21];//RCSD，SEQUENCE OF个数
			i*=5;
			if(p8rx[22+i]!=1)
			{//01 —— 记录数据
				return 2;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			if(p8rx[22+i+1]==0)
			{//记录数据个数=0
				return 2;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
			}
			i=UARTCtrl->TaskID;
			switch((i>>24)&0xf)//方案类型
			{
				case 2://事件采集方案
					return 0;
				default://普通采集方案
					//比较冻结时标(在最后)
		//68 68 00 C3 05 01 00 00 00 00 00 00 F6 60 85 03 1D    17byte
		//50 02 02 00 03 00 20 21 02 00 00 00 10 02 00 00 00 20 02 00 01 01 1C 07 E1 04 19 00 0F 00 01 05 06 00 09 00 B0 06 00 01 D4 C0 06 00 02 22 E0 06 00 01 FB D0 06 00 03 0D 40 01 05 06 00 09 00 B0 06 00 01 D4 C0 06 00 02 22 E0 06 00 01 FB D0 06 00 03 0D 40 00 00 4D 92 16
					i=(UARTCtrl->RMCSD[2]<<8)|UARTCtrl->RMCSD[3];
					switch(i)
					{
						case 0x5002://分钟冻结(采曲线数据)
						//case 0x5004://日冻结
						//case 0x5006://月冻结
							switch((UARTCtrl->TaskID>>20)&0xf)//采集类型
							{
								default:
								case 0://0=采集当前数据
								case 1://1=采集上第N次
									//不比较
									return 0;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
								case 2://2=按冻结时标采集
								case 3://3=按时标间隔采集
									break;
								case 4://4=RetryMetering 补抄
									break;
							}
							n=UARTCtrl->RMCSD[6];//RCSD，SEQUENCE OF个数
							for(i=0;i<n;i++)
							{
								x=(UARTCtrl->RMCSD[7+(i*4)]<<8)|UARTCtrl->RMCSD[7+(i*4)+1];
								if(x==0x2021)
								{//有数据冻结时间列选择发送
									n=p8rx[21];//RCSD，SEQUENCE OF个数
									for(i=0;i<n;i++)
									{
										x=p8rx[22+(i*5)+1]<<8;
										x|=p8rx[22+(i*5)+2];
										if(x==0x2021)
										{//找到接收冻结时间列选择
											p8rx+=22+(5*n)+2;
											while(i--)
											{
												p8rx+=Get_DL698DataLen_S(p8rx,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
											}
									#if CompareTime_5002==0//抄读分钟冻结(采曲线数据)是否比较冻结时间:0=不比较,1=比较
											p8rx++;
											for(i=0;i<7;i++)//秒不比较
											{
												p8rx[i]=UARTCtrl->date_time_s[i];
											}
											return 0;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
									#else
											if(p8rx[0]!=DataType_date_time_s)
											{//数据为空
												return 2;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
											}
											p8rx++;
											for(i=0;i<6;i++)//秒不比较
											{
												if(p8rx[i]!=UARTCtrl->date_time_s[i])
												{
													break;
												}
											}
											if(i>=6)
											{//冻结时间相同
												return 0;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
											}
											return 2;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
									#endif
										}
									}
									//没找到接收冻结时间列选择
									return 2;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
								}
							}
							break;
					}
					break;
			}
			break;
//		case 4://GetRequestRecordList
//			return 3;//返回0正确,1地址错,2控制码错(无数据),3数据标识错,4主动上报(已处理)
//		case 5://GetRequestNext
//			
//			break;
	}
	return 0;
}


//UART抄表数据缓冲定义
//#define LEN_RM_DI_CSD     512
//抄表数据缓冲1,最大总长度=LEN_RM_DI_CSD
//0 6byte 电能表地址
//6 2byte 长度=时标+已采集的CSD(不包括本身2字节)

//8 7byte 采集启动时标  date_time_s(无数据类型)
//15 7byte 采集成功时标  date_time_s(无数据类型)
//22 7byte 采集存储时标  date_time_s(无数据类型)
//29  采集的CSD  array CSD(有数据类型)

//抄表数据缓冲2,最大总长度=LEN_UARTnFnDataBuff-LEN_RM_DI_CSD
//LEN_RM_DI_CSD   2byte 长度=已填写入buff但还没完整一个CSD的数据长度(不包括本身2字节)
//LEN_RM_DI_CSD+2 2byte 长度=已填写入buff完整CSD的数据长度(不包括本身2字节)
//LEN_RM_DI_CSD+4 采集的数据(有数据类型)(ROAD时不写入总关联的OAD个数数组!!!)

u32 RM_RxDATA_DL698(u32 PORTn)//抄表接收数据处理:返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
{
	//u32 iii;
	u32 iRes;
	u32 i;
	u32 j;
	u32 x;
	u32 y;
	u32 z;
	u32 OAD;
	u32 ROAD;
	u32 NUM_RCSD;
	u32 OADrx;
	u32 NUM_RCSDrx;
	u8* p8;
//	u32 Data;
	u32 LEN_Rx;
	u32 LEN_RxDataBuff;
	u32 LEN_Data0;
	u32 LEN_Data1;
//	u8* p8Array;
	u32 NUM_RecordRow;
	u32 NUM_AddrData;
	u8* p8RMADDR;
	u32 NUM_ADDR;
	u8* p8Data;
	u16* p16Data;
	u8* p8rx;
	u32 m;
	UARTCtrl_TypeDef * UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);

	
#if(USER/100)==17//江苏系
	i=p8rx[14];
	if(i==0x88)//采集器有数据上报
	{
		UARTCtrl->res23=0;//一开始赋值为0
		p8Data=(u8 *)ADDR_DATABUFF;
		i=p8rx[15];
		//UARTCtrl->PIID=p8rx[16];
		UARTCtrl->PIID=(p8rx[16]&0x3f);
		x=0;
		switch(i)
		{
			case 6://ReportNotificationSimplifyRecord上报方式
				if(p8rx[21]==7)
				{
					p8RMADDR=(u8*)ADDR_4KWRITE_BUFF;
					if(p8rx[39]==3)//MS:一组用户地址
					{
						NUM_ADDR=p8rx[40];
						for(i=0;i<NUM_ADDR;i++)
						{
							MR((u32)p8RMADDR+i*6,(u32)p8rx+43+i*8,6);//
						}
					}                      
					
