gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_DL698.cpp
					MR((u32)p8Data+8,ADDR_DL698YMDHMS,7);//采集成功时标
					MR((u32)p8Data+15,ADDR_DL698YMDHMS,7);//采集成功时标
					MR((u32)p8Data+22,(u32)p8rx+22,7);//采集存储时标
					
					NUM_RCSD=1;
					NUM_RCSDrx=p8rx[45+NUM_ADDR*8];
					
					p8Data[29]=1;
					p8Data[30]=1;
					p8Data[31]=0x5B;
					p8Data[32]=1;
					MR((u32)p8Data+33,(u32)p8rx+41+NUM_ADDR*8,5+NUM_RCSDrx*4);
					MR((u32)UARTCtrl->RMCSD,(u32)p8Data+31,7+NUM_RCSDrx*4);					
					if(p8rx[41+5+NUM_RCSDrx*4+NUM_ADDR*8]==1)//响应数据choice的[1]A-SimplifyRecord
					{
						if(p8rx[38]==1)
						{
							UARTCtrl->res23=3;//1分钟曲线数据
						}
						else
						{
							UARTCtrl->res23=8;//其他分钟曲线数据
						}
					}
					else if(p8rx[41+5+NUM_RCSDrx*4+NUM_ADDR*8]==0xc8)//DAR=200表示无后续帧
					{
						if(p8rx[38]==1)
						{
							UARTCtrl->res23=4;//1分钟曲线数据
						}
						else
						{
							UARTCtrl->res23=9;//其他分钟曲线数据
						}
					}
					
					LEN_Data0=0;//表示接收到的数据的长度					
					NUM_AddrData=p8rx[47+NUM_RCSDrx*4+NUM_RCSDrx+NUM_ADDR*8+LEN_Data0];
					NUM_AddrData=(NUM_AddrData/NUM_ADDR);
					for(i=0;i<NUM_ADDR;i++)
					{
						MR((u32)p8Data,(u32)p8RMADDR+i*6,6);
						//LEN_Data1=30+NUM_RCSDrx*4+NUM_ADDR*8;//表示存储数据的长度				
						z=NUM_RCSDrx;
						for(j=0;j<NUM_AddrData;j++)
						{
							LEN_Data1=30+NUM_RCSDrx*4+8;//表示存储数据的长度
							for(x=0;x<NUM_RCSDrx;x++)//ROAD中OAD的数量
							{
								OAD=UARTCtrl->RMCSD[7+(4*x)]<<24;
								OAD|=UARTCtrl->RMCSD[8+(4*x)]<<16;
								OAD|=UARTCtrl->RMCSD[9+(4*x)]<<8;
								OAD|=UARTCtrl->RMCSD[10+(4*x)];
								if(OAD==0x20210200)
								{
									z=x;
									break;
								}
							}
							MR((u32)p8Data+22,(u32)p8rx+22,7);//采集存储时标
							y=j*p8rx[38]*60;
							if(x==NUM_RCSDrx)
							{
								pYYMDHMS_AddS_hex(p8Data+22,y);//采集存储时标
							}
							for(x=0;x<NUM_RCSDrx;x++)
							{
								y=p8rx[42+5+NUM_RCSDrx*4+x+NUM_ADDR*8];
								p8Data[LEN_Data1]=y;
								y=Get_DL698DataLen_S(p8rx+47+NUM_RCSDrx*4+x+NUM_ADDR*8,0);
								m=Deal_DataNull_JS(p8Data[LEN_Data1],p8rx+42+5+NUM_RCSDrx*4+NUM_ADDR*8+NUM_RCSDrx+LEN_Data0+1);
								if(m==1)
								{
									p8Data[LEN_Data1]=0;
									LEN_Data0+=(y-1);
									LEN_Data1+=1;
								}
								else
								{
									MR((u32)p8Data+LEN_Data1+1,(u32)p8rx+42+5+NUM_RCSDrx*4+NUM_ADDR*8+NUM_RCSDrx+LEN_Data0+1,y-1);
									if(z!=NUM_RCSDrx)//冻结时间存储成采集存储时标
									{
										MR((u32)p8Data+22,(u32)p8rx+42+5+NUM_ADDR*8+NUM_RCSDrx*4+NUM_RCSDrx+LEN_Data0+1,y-1);
										z=NUM_RCSDrx;
									}
									LEN_Data0+=(y-1);
									LEN_Data1+=y;
								}
							}
							p8Data[6]=(LEN_Data1-8)&0xff;
							p8Data[7]=(LEN_Data1-8)>>8;
							RM_RecordFile(PORTn,p8Data);
							iRes=UARTCtrl->res23;
							switch(iRes)
							{
								case 3:
								case 4:
									UARTCtrl->res23=12;
									RM_RecordFile(PORTn,p8Data);
									UARTCtrl->res23=iRes;
									break;
								case 8:
								case 9:
									UARTCtrl->res23=13;
									RM_RecordFile(PORTn,p8Data);
									UARTCtrl->res23=iRes;
									break;
								default:
									return 0;	
							}
						
						}
					}
					return 0;
				}
				break;
			case 2://上报若干个记录型对象属性
				//UARTCtrl->res23=2;
				if(p8rx[22]!=1)
					return 1;
				MR((u32)p8Data,(u32)p8rx+5,6);
				Data_Inverse((u32)p8Data,6);
				if((p8rx[24]==0x50)&&(p8rx[25]==0x04))
				{
					UARTCtrl->res23=1;//有后续帧，日冻结
					i=p8rx[28];
					if(p8rx[i*4+28+1]==0)
					{
						UARTCtrl->res23=6;//无后续帧，日冻结
					}
				}
				else if((p8rx[24]==0x50)&&(p8rx[25]==0x06))
				{
					UARTCtrl->res23=2;//有后续帧，月冻结
					i=p8rx[28];
					if(p8rx[i*4+28+1]==0)
					{
						UARTCtrl->res23=7;//无后续帧，月冻结
					}
				}
				else
					return 1;	
				
				NUM_RCSD=p8rx[23];
				p8Data[29]=1;
				p8Data[30]=1;
				p8Data[31]=0x5B;
				p8Data[32]=1;
				NUM_RCSDrx=p8rx[28];
				MR((u32)p8Data+33,(u32)p8rx+24,5+NUM_RCSDrx*4);
				MR((u32)p8Data+8,ADDR_DL698YMDHMS,7);//采集启动时标
				MR((u32)p8Data+15,ADDR_DL698YMDHMS,7);//采集成功时标
				MR((u32)p8Data+22,ADDR_DL698YMDHMS,7);//采集成功时标

				UARTCtrl->RMCSD[1]=p8rx[23];
				if(UARTCtrl->RMCSD[1]==1)
				{//ROAD
					MR((u32)UARTCtrl->RMCSD,(u32)p8Data+31,7+NUM_RCSDrx*4);
				}	
				NUM_RecordRow=p8rx[NUM_RCSDrx*4+28+2];
				p8=p8rx+24+(4*NUM_RCSDrx)+7;
				LEN_Data1=0;
				//p8+=2;
				while(NUM_RecordRow--)//记录条数
				{
					y=p8[1];
					LEN_Data1=38+NUM_RCSDrx*4;//表示存储数据的长度
					LEN_Data0=2;
					for(x=0;x<y;x++)//ROAD中OAD的数量
					{
						OAD=UARTCtrl->RMCSD[7+(4*x)]<<24;
						OAD|=UARTCtrl->RMCSD[8+(4*x)]<<16;
						OAD|=UARTCtrl->RMCSD[9+(4*x)]<<8;
						OAD|=UARTCtrl->RMCSD[10+(4*x)];
						if(OAD==0x20210200)
						{
							i=Get_DL698DataLen_S(p8+LEN_Data0,0);
							MR((u32)p8Data+22,(u32)p8+1+LEN_Data0,7);
							MR((u32)p8Data+LEN_Data1,(u32)p8+LEN_Data0,8);
							pYYMDHMS_SubS_hex(p8Data+22,60);
							pYYMDHMS_SubS_hex(p8Data+LEN_Data1+1,60);
							LEN_Data0+=i;
							LEN_Data1+=i;
							continue;
						}
						if(OAD==0x10100200)
						{
							if((UARTCtrl->res23==1)||(UARTCtrl->res23==6))
								UARTCtrl->res23=10;
							else if((UARTCtrl->res23==2)||(UARTCtrl->res23==7))
								UARTCtrl->res23=11;
						}
						i=Get_DL698DataLen_S(p8+LEN_Data0,0);
						MR((u32)p8Data+LEN_Data1,(u32)p8+LEN_Data0,i);
						LEN_Data1+=i;
						LEN_Data0+=i;
					}
					p8Data[6]=(LEN_Data1-8)&0xff;
					p8Data[7]=(LEN_Data1-8)>>8;
					RM_RecordFile(PORTn,p8Data);
					p8+=LEN_Data0;
				}			
				return 0;
		}
	}
	else if(i==0x87)
	{
		if(p8rx[21]==0x06)//采集器无数据响应
		{
			UARTCtrl->res23=5;
			return 0;
		}
		if(p8rx[21]==0)
		{
			UARTCtrl->res23=5;
			return 0;
		}
	}
#endif
	
	
//	p8Array=(u8*)p8Data;
//	LEN_Data0=p16Data[0];
//	if(LEN_RxDataBuff<LEN_Data0)
//	{//错
//		return 1;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
//	}
//	LEN_RxDataBuff-=LEN_Data0;
	
	LEN_RxDataBuff=Get_LEN_UARTnFnDataBuff(PORTn);//得到UART抄表数据缓冲长度
	LEN_RxDataBuff-=(LEN_RM_DI_CSD+4);
	p8Data=(u8 *)Get_ADDR_UARTnFnDataBuff(PORTn);
	p16Data=(u16*)(p8Data+LEN_RM_DI_CSD);
	LEN_Data1=p16Data[1];
	if(LEN_RxDataBuff<LEN_Data1)
	{//错
		return 3;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	LEN_RxDataBuff-=LEN_Data1;
	p8Data+=LEN_RM_DI_CSD+4+LEN_Data1;
	
