gdgly/NUC97X_JS/STM32F4xx/DL698/RM_RxDATA_DL698.cpp
	//无数据(空数据)
	if(UARTCtrl->RM_Rx_date_NULL!=0)//抄表接收返回:0=有数据,!=0无数据(空数据)
	{
		if(UARTCtrl->RMCSD[1]==0)
		{//OAD
			LEN_Rx=1;
		}
		else
		{//ROAD
			LEN_Rx=UARTCtrl->RMCSD[6];
		}	
		if(LEN_RxDataBuff<LEN_Rx)
		{//缓冲长度不够
			return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		}
		for(i=0;i<LEN_Rx;i++)
		{
			p8Data[i]=0;
		}
		p16Data[0]=LEN_Rx;
		return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
	}
	
	LEN_Rx=p8rx[1]+(p8rx[2]<<8);
	#if(USER/100)==15//安徽
	if(LEN_Rx<(13+8+3))
	{//长度<x
		return 0;
	}
	if(LEN_Rx==(13+8+3))
	{//长度==x 空数据
		if(UARTCtrl->RMCSD[1]==0)
		{//OAD
			LEN_Rx=1;
		}
		else
		{//ROAD
			LEN_Rx=UARTCtrl->RMCSD[6];
		}	
		if(LEN_RxDataBuff<LEN_Rx)
		{//缓冲长度不够
			return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		}
		for(i=0;i<LEN_Rx;i++)
		{
			p8Data[i]=0;
		}
		p16Data[0]=LEN_Rx;
		return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数

	}
	#else
	if(LEN_Rx<=(13+8+3))
	{//长度<x
		return 0;
	}
	#endif
	
	i=p8rx[15];
	switch(i)
	{
		default:
			if(UARTCtrl->RMCSD[1]==0)
			{//OAD
				LEN_Rx=1;
			}
			else
			{//ROAD
				LEN_Rx=UARTCtrl->RMCSD[6];
			}	
			if(LEN_RxDataBuff<LEN_Rx)
			{//缓冲长度不够
				return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
			}
			for(i=0;i<LEN_Rx;i++)
			{
				p8Data[i]=0;
			}
			p16Data[0]=LEN_Rx;
			return 4;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
		case 1://GetRequestNormal
			LEN_Rx=Get_DL698DataLen_S(p8rx+22,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
			if(LEN_RxDataBuff<LEN_Rx)
			{//缓冲长度不够
				return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
			}
			p8rx+=22;
			if(UARTCtrl->RM_Rx_date_40020200[0]==1)//抄表接收到的数据用于MAC验证的电能表表号;0th=状态(0=空,1=正在抄,2=完成),1th=表号长度(<=6),2th-7th表号值
			{
//68 23 00 C3 05 01 00 00 00 00 00 00 EA EF 85 01 01 40 02 02 00 01 09 08 00 00 00 00 00 00 00 00 00 00 66 5F 16
				MC(0,((u32)&UARTCtrl->RM_Rx_date_40020200)+2,8);
				i=p8rx[1];//表号长度
				if(i>8)
				{
					i=8;
				}
				UARTCtrl->RM_Rx_date_40020200[1]=i;
				x=8-i;
				MR(((u32)&UARTCtrl->RM_Rx_date_40020200)+2+x,(u32)p8rx+2,i);
				UARTCtrl->RM_Rx_date_40020200[0]=2;//抄表接收到的数据用于MAC验证的电能表表号;0th=状态(0=空,1=正在抄,2=完成),1th=表号长度(<=6),2th-7th表号值
				UARTCtrl->RMCSDSubCount--;//抄表CSD子计数
				return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
			}
			for(i=0;i<LEN_Rx;i++)
			{
				p8Data[i]=p8rx[i];
			}
			p16Data[0]=LEN_Rx;
			
			//检查跟随上报
			if((PORTn==RS485_1PORT)||(PORTn==RS485_2PORT))
			{
				//若干个对象属性及其数据        [1]  SEQUENCE OF A-ResultNormal，
				//若干个记录型对象属性及其数据  [2]  SEQUENCE OF A-ResultRecord
				p8rx+=LEN_Rx;
				if(p8rx[0]!=0)
				{//有跟随上报
				#if EnMeterAutoReportEvent==1//允许电能表主动上报事件:0=不允许,1=允许
					if(UARTCtrl->AutoReportTask==0)//电能表主动上报任务:0=空,1=有主动上报等待读取,2...抄读中
					{
						UARTCtrl->AutoReportTask=1;//电能表主动上报任务:0=空,1=有主动上报等待读取,2...抄读中
						UARTCtrl->AutoReportRMprotocol=3;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
						MW((u32)&UARTCtrl->RMAddr,(u32)&UARTCtrl->AutoReportRMAddr,6);
					}
				#endif
				}
			}
			break;
//		#if (USER/100)==17//江苏系
//			case 2://GetResponseNormalList-----江苏抄表日数据采用GetResponseNormalList方式应答
//				ROAD=UARTCtrl->RMCSD[1];
//				if(ROAD==1)
//				{//ROAD
//					ROAD=UARTCtrl->RMCSD[2+0]<<24;
//					ROAD|=UARTCtrl->RMCSD[2+1]<<16;
//					ROAD|=UARTCtrl->RMCSD[2+2]<<8;
//					ROAD|=UARTCtrl->RMCSD[2+3];
//				}
//				NUM_RCSD=UARTCtrl->RMCSD[6];
//				NUM_RCSDrx=p8rx[17];//RCSD，SEQUENCE OF个数
//				p16Data[0]=0;
//				for(x=0;x<NUM_RCSD;x++)
//				{
//					OAD=UARTCtrl->RMCSD[7+(4*x)]<<24;
//					OAD|=UARTCtrl->RMCSD[8+(4*x)]<<16;
//					OAD|=UARTCtrl->RMCSD[9+(4*x)]<<8;
//					OAD|=UARTCtrl->RMCSD[10+(4*x)];
//					LEN_Data0=0;
//					for(y=0;y<NUM_RCSDrx;y++)
//					{
//							OADrx=p8rx[18+LEN_Data0]<<24;
//							OADrx|=p8rx[18+LEN_Data0+1]<<16;
//							OADrx|=p8rx[18+LEN_Data0+2]<<8;
//							OADrx|=p8rx[18+LEN_Data0+3];
//							if(OAD==OADrx)
//							{
//								break;
//							}
//							i=p8rx[18+LEN_Data0+4];
//							if(i==0)
//								LEN_Data0+=2;
//							else
//							{
//								i=Get_DL698DataLen_S(p8rx+18+LEN_Data0+5,0);
//								LEN_Data0+=i;
//							}
//								
//					}
//					if(y>=NUM_RCSDrx)
//					{//没找到列选择OAD
//						if(LEN_RxDataBuff<1)
//						{//缓冲长度不够
//							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
//						}
//						p8Data[0]=0;
//						p8Data+=1;
//						LEN_RxDataBuff-=1;
//						p16Data[0]+=1;
//					}
//					else
//					{
//						i=p8rx[18+LEN_Data0+4];
//						if(i==0)
//							LEN_Data0+=2;
//						else
//						{
//							i=Get_DL698DataLen_S(p8rx+18+LEN_Data0+5,0);
//							MW((u32)p8rx+18+LEN_Data0+5,(u32)p8Data,i);
//							p8Data+=i;
//							LEN_RxDataBuff-=i;
//							p16Data[0]+=i;
//						}
//					}
//				}
//				//检查跟随上报
//				if((PORTn==RS485_1PORT)||(PORTn==RS485_2PORT))
//				{
//					p8=p8rx+18+LEN_Data0;
//					while(NUM_RCSDrx--)
//					{
//						i=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
//						p8+=i;
//					}
//					if(p8[0]!=0)
//					{//有跟随上报
//					#if EnMeterAutoReportEvent==1//允许电能表主动上报事件:0=不允许,1=允许
//						if(UARTCtrl->AutoReportTask==0)//电能表主动上报任务:0=空,1=有主动上报等待读取,2...抄读中
//						{
//							UARTCtrl->AutoReportTask=1;//电能表主动上报任务:0=空,1=有主动上报等待读取,2...抄读中
//							UARTCtrl->AutoReportRMprotocol=3;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
//							MW((u32)&UARTCtrl->RMAddr,(u32)&UARTCtrl->AutoReportRMAddr,6);
//						}
//					#endif
//					}
//				}
//				break;
//		#endif
		case 2://GetRequestNormalList

			break;
		case 3://GeResponseRecord
		#if CompareMeterEventCount==1//全事件采集抄表是否比较发生次数:0=不比较(全部抄表数据写入文件),1=比较(只有次数变化的事件写入文件)
			i=UARTCtrl->TaskID;
			if(((i>>24)&0xf)==2)
			{//事件采集方案
				i=Get_RxDATA_DL698_MeterEventCount(PORTn);//从698读事件记录接收帧中取出电能表事件发生次数(事件记录序号);返回:发生次数,没找到时返回0xffffffff
				if(i==0xffffffff)
				{
					return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
				OAD=UARTCtrl->RMCSD[2+0]<<24;
				OAD|=UARTCtrl->RMCSD[2+1]<<16;
				OAD|=UARTCtrl->RMCSD[2+2]<<8;
				OAD|=UARTCtrl->RMCSD[2+3];
				x=UARTCtrl->TaskID;
				x>>=8;
				x&=0xff;
				x=UARTCtrl->MeterCount[x];//2*RMTASKmax byte各任务已抄电能表计数,主动上报时用于文件中已上报电能表计数
				i=CompSourMeterEventCount(x,OAD,i);//比较原电能表事件次数;入口:SetNo=档案配置号(0开始),Count=当前次数;返回:0=初始值,1=次数相同,2=次数不同,同时修改原计数,使用ADDR_DATABUFF
				if(i!=2)
				{
					return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
				}
			}
		#endif
			ROAD=UARTCtrl->RMCSD[1];
			if(ROAD==1)
			{//ROAD
				ROAD=UARTCtrl->RMCSD[2+0]<<24;
				ROAD|=UARTCtrl->RMCSD[2+1]<<16;
				ROAD|=UARTCtrl->RMCSD[2+2]<<8;
				ROAD|=UARTCtrl->RMCSD[2+3];
			}
			NUM_RCSD=UARTCtrl->RMCSD[6];
			NUM_RCSDrx=p8rx[21];//RCSD，SEQUENCE OF个数
			if(NUM_RCSD==0)
			{//当无一个OAD时，RCSD=0，即SEQUENCE OF的数据项个数为0，表示“不选择（即全选）”
				//为方便计算将接收的CSD复制作为发送选择的CSD
				x=NUM_RCSDrx*4;
				if((x+7)<sizeof(UARTCtrl->RMCSD))
				{
					UARTCtrl->RMCSD[6]=NUM_RCSDrx;
					for(y=0;y<NUM_RCSDrx;y++)
					{
						UARTCtrl->RMCSD[7+(4*y)]=p8rx[22+(y*5)+1];
					}
				}
			}
			p16Data[0]=0;
			for(x=0;x<NUM_RCSD;x++)
			{
				OAD=UARTCtrl->RMCSD[7+(4*x)]<<24;
				OAD|=UARTCtrl->RMCSD[8+(4*x)]<<16;
				OAD|=UARTCtrl->RMCSD[9+(4*x)]<<8;
				OAD|=UARTCtrl->RMCSD[10+(4*x)];
				for(y=0;y<NUM_RCSDrx;y++)
				{
					if(p8rx[22+(y*5)+0]==0)
					{
						OADrx=p8rx[22+(y*5)+1]<<24;
						OADrx|=p8rx[22+(y*5)+2]<<16;
						OADrx|=p8rx[22+(y*5)+3]<<8;
						OADrx|=p8rx[22+(y*5)+4];
						if(OAD==OADrx)
						{
							break;
						}
					}
				}
				if(y>=NUM_RCSDrx)
				{//没找到列选择OAD
					if(LEN_RxDataBuff<1)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					p8Data[0]=0;
					p8Data+=1;
					LEN_RxDataBuff-=1;
					p16Data[0]+=1;
				}
				else
				{//找到列选择OAD
					p8=p8rx+22+(5*NUM_RCSDrx)+2;
					while(y--)
					{
						i=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
						p8+=i;
					}
					y=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
//				#if CompareTime_5004==1//抄读日冻结是否比较冻结时间:0=不比较,1=比较
//						if(ROAD==0x50040200)
//						{//日冻结
//							if(OAD==0x20210200)
//							{//数据冻结时间
//								for(i=0;i<4;i++)
//								{
//									if(p8[1+i]!=Comm_Ram->DL698YMDHMS[i])
//									{
//										break;
//									}
//								}
//								if(i<4)
//								{//年月日不同
//									p16Data[0]=0;
//									return 0;
//								}
//							}
//						}
//				#endif

				//#if (USER==901)//河南版
					if(ROAD==0x50020200)
					{//分钟冻结(曲线)
						switch(OAD)
						{
							//方案里是”00100201“和”00200201“，主站用”00100200“和”00200200“召读，费率电量可以是空，只把总电量返回就行了
							case 0x00100201://正向有功电能总
							case 0x00200201://反向有功电能总
							case 0x00300201://组合无功1电能总
							case 0x00400201://组合无功2电能总
							case 0x00500201://第1象限无功电能总
							case 0x00600201://第2象限无功电能总
							case 0x00700201://第3象限无功电能总
							case 0x00800201://第4象限无功电能总
								UARTCtrl->RMCSD[10+(4*x)]=0;
								if(LEN_RxDataBuff<2)
								{//缓冲长度不够
									return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
								}
								p8Data[0]=DataType_array;
								p8Data[1]=5;
								p8Data+=2;
								LEN_RxDataBuff-=2;
								p16Data[0]+=2;
								
								if(LEN_RxDataBuff<(y+4))
								{//缓冲长度不够
									return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
								}
								if(y<=1)
								{//无数据
									if(LEN_RxDataBuff<5)
									{//缓冲长度不够
										return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
									}
									p8Data[0]=0;
									y=1;
								}
								else
								{
									for(i=0;i<y;i++)
									{
										p8Data[i]=p8[i];
									}
								}
								p8Data[y]=0;//费率1
								p8Data[y+1]=0;//费率2
								p8Data[y+2]=0;//费率3
								p8Data[y+3]=0;//费率4
								p8Data+=y+4;
								LEN_RxDataBuff-=y+4;
								p16Data[0]+=y+4;
								continue;
							case 0x20000201://A相电压
							case 0x20010201://A相电流
								UARTCtrl->RMCSD[10+(4*x)]=0;
								if(LEN_RxDataBuff<2)
								{//缓冲长度不够
									return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
								}
								p8Data[0]=DataType_array;
								p8Data[1]=3;
								p8Data+=2;
								LEN_RxDataBuff-=2;
								p16Data[0]+=2;
								
								if(LEN_RxDataBuff<(y+2))
								{//缓冲长度不够
									return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
								}
								if(y<=1)
								{//无数据
									if(LEN_RxDataBuff<3)
									{//缓冲长度不够
										return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
									}
									p8Data[0]=0;
									y=1;
								}
								else
								{
									for(i=0;i<y;i++)
									{
										p8Data[i]=p8[i];
									}
								}
								p8Data[y]=0;//B相空
								p8Data[y+1]=0;//C相空
								p8Data+=y+2;
								LEN_RxDataBuff-=y+2;
								p16Data[0]+=y+2;
								continue;
							case 0x20040202://A相有功功率
							case 0x20050202://A相无功功率
							case 0x200A0202://A相功率因数
								UARTCtrl->RMCSD[10+(4*x)]=0;
								if(LEN_RxDataBuff<2)
								{//缓冲长度不够
									return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
								}
								p8Data[0]=DataType_array;
								p8Data[1]=1;
								p8Data+=2;
								LEN_RxDataBuff-=2;
								p16Data[0]+=2;
								
								if(LEN_RxDataBuff<y)
								{//缓冲长度不够
									return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
								}
								if(y<=1)
								{//无数据
									if(LEN_RxDataBuff<1)
									{//缓冲长度不够
										return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
									}
									p8Data[0]=0;
									y=1;
								}
								else
								{
									for(i=0;i<y;i++)
									{
										p8Data[i]=p8[i];
									}
								}
								p8Data+=y;
								LEN_RxDataBuff-=y;
								p16Data[0]+=y;
								continue;
						}
					}
				//#endif
					if(y<=1)
					{//无数据
						if(LEN_RxDataBuff<1)
						{//缓冲长度不够
							return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
						}
						p8Data[0]=0;
						p8Data+=1;
						LEN_RxDataBuff-=1;
						p16Data[0]+=1;
						continue;
					}
					if(LEN_RxDataBuff<y)
					{//缓冲长度不够
						return 2;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
					}
					for(i=0;i<y;i++)
					{
						p8Data[i]=p8[i];
					}
					p8Data+=y;
					LEN_RxDataBuff-=y;
					p16Data[0]+=y;
				}
			}
			
			//检查跟随上报
			if((PORTn==RS485_1PORT)||(PORTn==RS485_2PORT))
			{
				p8=p8rx+22+(5*NUM_RCSDrx)+2;
				while(NUM_RCSDrx--)
				{
					i=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
					p8+=i;
				}
				if(p8[0]!=0)
				{//有跟随上报
				#if EnMeterAutoReportEvent==1//允许电能表主动上报事件:0=不允许,1=允许
					if(UARTCtrl->AutoReportTask==0)//电能表主动上报任务:0=空,1=有主动上报等待读取,2...抄读中
					{
						UARTCtrl->AutoReportTask=1;//电能表主动上报任务:0=空,1=有主动上报等待读取,2...抄读中
						UARTCtrl->AutoReportRMprotocol=3;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
						MW((u32)&UARTCtrl->RMAddr,(u32)&UARTCtrl->AutoReportRMAddr,6);
					}
				#endif
				}
			}
			break;
//		case 4://GetRequestRecordList
//			
//			break;
//		case 5://GetRequestNext
//			
//			break;
	}
	return 0;//返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127,6=抄表计数大于最大数
}























